artillery/api-test.yml
config:
  # base url 정의 (우리는 domain을 작성)
  target: "http://localhost:3000"
  phases:
    # 부하테스트 시간 (초)
    - duration: 30
    # 부하테스트 동안의 사용자 수 (초당 요청 수)
      arrivalRate: 10
      name: api-request-test
# 부하 테스트 시나리오
scenarios:
  # 시나리오 정의
  - name: "just get hash"
    flow:
      - get:
          url: "/heavy-api"